{
  "backend/main.mo": "Main backend actor implementing user profiles, complaints, tree plantation, solar applications, and water projects with role-based access control (Citizen/Admin) and blob storage integration for photos/documents.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (authentication, complaint reporting, admin management, ratings, tree plantation, solar/water modules) to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend components including admin pages, charts, scheme pages, and styling, documenting their purposes and key fixes.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light/dark theme variables for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Smart Grama Sustainability Platform React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for citizen pages (complaints, tree, water, solar, schemes) and admin pages (dashboard, management), wrapped in QueryClient, Theme, and Language providers.",
  "frontend/src/components/admin/ComplaintsBarChart.tsx": "Bar chart component visualizing complaint counts grouped by category (garbage, street light, drainage, others) using recharts.",
  "frontend/src/components/admin/MetricsCards.tsx": "Dashboard metrics cards showing total complaints with completion rate, tree survival rate, solar installations, water projects, and total requests across all modules.",
  "frontend/src/components/admin/MonthlyActivityChart.tsx": "Displays a line chart showing monthly trends for complaints, trees, water projects, and solar applications over the last 6 months using Recharts.",
  "frontend/src/components/admin/RecentActivityFeed.tsx": "Shows a scrollable feed of the 10 most recent activities across complaints, trees, water projects, and solar applications with icons and timestamps.",
  "frontend/src/components/admin/StatusPieChart.tsx": "Renders a pie chart displaying the distribution of complaint statuses (pending, in progress, completed) with percentages.",
  "frontend/src/components/ComplaintCard.tsx": "Displays individual complaint details with category badge, status, photo, location, assigned worker, submission date, and conditional rating form for completed complaints owned by the current user.",
  "frontend/src/components/ComplaintRatingForm.tsx": "Interactive 5-star rating component with hover effects allowing users to rate completed complaint work, submitting ratings via mutation hook.",
  "frontend/src/components/Footer.tsx": "Footer component displaying contact info, quick links, disclaimer, and copyright with a caffeine.ai attribution link. Uses language context for internationalization.",
  "frontend/src/components/Header.tsx": "Header component showing India emblem, Smart Grama title with tagline, and login button. Sticky positioned at top with saffron background.",
  "frontend/src/components/LanguageToggle.tsx": "Toggle button component that switches between English and Telugu languages using the language context.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Header, Navbar, main content outlet, Footer, and ProfileSetupModal in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/Navbar.tsx": "Navigation bar with responsive menu showing links to all pages (home, report issue, tree, water, solar, schemes, my requests, admin). Includes language toggle and admin-only links.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, collecting name and mobile number. Shows automatically when authenticated user has no profile.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that checks authentication and optionally admin role, displaying appropriate error messages if access is denied.",
  "frontend/src/components/SolarApplicationCard.tsx": "Card component displaying solar application details including status badge, three document images (Aadhaar, bill, house photo), and submission date.",
  "frontend/src/components/StatusBadge.tsx": "Badge component that displays status (pending, inProgress, completed) with appropriate color, icon, and label.",
  "frontend/src/components/TreeRequestCard.tsx": "Card component showing tree request details including tree type, survival status badge, photo, location, and planting date.",
  "frontend/src/components/WaterProjectCard.tsx": "Card component displaying water project information with status badge, land photo, assigned worker name, and submission date.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for managing language selection (English/Telugu) and translation function for the application.",
  "frontend/src/data/schemes.ts": "Defines the Scheme interface and exports an array of government schemes with details like eligibility, benefits, application process, and contact information.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login, logout, and identity management with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all data operations including complaints, trees, water projects, solar applications, and user profiles, with mutations for creating, updating, and rating records.",
  "frontend/src/hooks/useUserProfile.ts": "Provides a React Query hook to fetch the current user's profile from the backend actor, with loading and fetching state management.",
  "frontend/src/hooks/useUserRole.ts": "Exports a hook that fetches the caller's user role (admin/user/guest) and provides boolean flags for role checking.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes, government-themed colors (saffron and green), and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays information about Smart Grama's mission, key features (complaint management, tree tracking, water/solar projects), and impact on rural governance.",
  "frontend/src/pages/admin/ComplaintsManagementPage.tsx": "Admin page for managing citizen complaints with filtering by category, status updates, and worker assignment functionality. Displays complaints in a grid with photos, descriptions, and status badges.",
  "frontend/src/pages/admin/DashboardPage.tsx": "Admin dashboard overview page that displays metrics, charts, and recent activity for complaints, trees, water projects, and solar applications using various chart components.",
  "frontend/src/pages/admin/SolarManagementPage.tsx": "Admin page for managing solar panel applications with status updates, document viewing, and metrics showing total applications, installed homes, CO2 reduction, and energy generation estimates.",
  "frontend/src/pages/admin/TreeManagementPage.tsx": "Admin page for tracking planted trees with survival status toggles, displaying tree photos, locations, planting dates, and overall survival rate statistics.",
  "frontend/src/pages/admin/WaterProjectsManagementPage.tsx": "Admin page for managing water conservation projects with status updates, worker assignment, and metrics showing total projects, completed projects, and completion rate.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero banner and service cards linking to report issues, tree plantation, water harvesting, solar schemes, and government schemes.",
  "frontend/src/pages/MyRequestsPage.tsx": "Protected page that displays all user's submitted requests organized by type: complaints, tree requests, water projects, and solar applications.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the privacy policy covering information collection, usage, storage, sharing, user rights, and policy updates for the Smart Grama platform.",
  "frontend/src/pages/ReportIssuePage.tsx": "Form page for citizens to submit complaints with fields for name, mobile, category, description, photo/audio uploads, and auto-detected location. Pre-fills user profile data and navigates to 'my-requests' on submission.",
  "frontend/src/pages/SchemeDetailPage.tsx": "Displays detailed information about a government scheme including description, eligibility, benefits, application process, required documents, contact details, and optional website link. Fetches scheme data by ID from local data file.",
  "frontend/src/pages/SchemesPage.tsx": "Grid view listing all available government schemes as clickable cards showing name, ministry, and description excerpt. Links to individual scheme detail pages.",
  "frontend/src/pages/SolarSchemePage.tsx": "Application form for solar scheme requiring three file uploads: Aadhaar document, electricity bill, and house photo. Submits application and redirects to 'my-requests' page.",
  "frontend/src/pages/TermsPage.tsx": "Static page displaying terms of service with eight sections covering acceptance, user responsibilities, service scope, content guidelines, intellectual property, liability, governing law, and modifications.",
  "frontend/src/pages/TreePlantationPage.tsx": "Form for requesting tree plantation with tree type selection, optional photo upload, and auto-detected GPS location. Submits request and navigates to 'my-requests' page.",
  "frontend/src/pages/WaterHarvestingPage.tsx": "Simple form for requesting water harvesting project requiring only a land photo upload. Submits request and redirects to 'my-requests' page on completion.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables for dark mode support, custom border radius, animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document for Smart Grama Sustainability Platform defining a MERN-stack government digital platform with features for complaint reporting, tree plantation tracking, rainwater harvesting, solar schemes, role-based authentication, admin dashboard, and map integration with detailed architectural notes and image requirements."
}